In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

%matplotlib inline

In [2]:
#Loading the required datasets

results_2023 = pd.read_csv('../data/2023_results.csv')
races_2023 = pd.read_csv('../data/2023_races.csv')
results_2024 = pd.read_csv('../data/2024_results.csv')
races_2024 = pd.read_csv('../data/2024_races.csv')
boston_men = pd.read_csv('../data/boston_men.csv')
boston_women = pd.read_csv('../data/boston_women.csv')
survey_summary = pd.read_csv('../data/survey_summary.csv')

In [3]:
results_2023.head()

,Name,Race,Year,Gender,Age,Finish,Age Bracket
0,Arunas Jurkus,Salt Lake City Marathon,2023,M,55,12907,55-59
1,Seth Reed,Salt Lake City Marathon,2023,M,24,12921,Under 35
2,Mufaro Chivasa,Salt Lake City Marathon,2023,M,54,12948,50-54
3,Adam Cheney,Salt Lake City Marathon,2023,M,22,12954,Under 35
4,Michael Pyles,Salt Lake City Marathon,2023,M,33,12964,Under 35

In [4]:
results_2024.head()

,Name,Race,Year,Gender,Finish,Age Group
0,Zouhair Talbi,Houston Marathon,2024,Men,7599,25-29
1,Tsedat Ayana,Houston Marathon,2024,Men,7620,25-29
2,Hendrik Pfeiffer,Houston Marathon,2024,Men,7634,30-34
3,Pat Tiernan,Houston Marathon,2024,Men,7665,25-29
4,Hugo Edgardo Catrileo Tapia,Houston Marathon,2024,Men,7724,25-29

We are missing 'Age' from the 2024 results dataset compared to the 2023 results. This will be dealt with later during cleaning.

In [5]:
races_2023.head()

                Race  Year      Date  Finishers
0       NYC Marathon  2023   11/5/23      51295
1   Chicago Marathon  2023   10/8/23      48574
2    Boston Marathon  2023   4/17/23      26600
3        LA Marathon  2023   3/19/23      16973
4  Honolulu Marathon  2023  12/10/23      15044

In [6]:
races_2024.head()

                              Race  Year        Date  Finishers
0                 Houston Marathon  2024  2024-01-14       7180
1                 Atlanta Marathon  2024  2024-02-24       1582
2            Disney World Marathon  2024  2024-01-03      12710
3                  Carmel Marathon  2024  2024-04-13       1451
4  Jack and Jill Downhill Marathon  2024  2024-07-27        701

In [7]:
boston_men.head()

,Year,Winner,Country,Time,Distance (Miles),Distance (KM)
0,1897.0,John McDermott,United States,02:55:10,24.5,39.4
1,1898.0,Ronald MacDonald,Canada,02:42:00,24.5,39.4
2,1899.0,Lawrence Brignolia,United States,02:54:38,24.5,39.4
3,1900.0,Jack Caffery,Canada,02:39:44,24.5,39.4
4,1901.0,Jack Caffery,Canada,02:29:23,24.5,39.4

In [8]:
boston_women.head()

,Year,Winner,Country,Time,Distance (Miles),Distance (KM)
0,1966.0,Bobbi Gibb,United States,3:21:40,26.2,42.2
1,1967.0,Bobbi Gibb,United States,3:27:17,26.2,42.2
2,1968.0,Bobbi Gibb,United States,3:30:00,26.2,42.2
3,1969.0,Sara Mae Berman,United States,3:22:46,26.2,42.2
4,1970.0,Sara Mae Berman,United States,3:05:07,26.2,42.2

In [9]:
survey_summary.head()

  Category Subcategory  Value Type
0   Gender      Female     55    %
1   Gender        Male     43    %
2   Gender  Non-binary      2    %
3      Age    Under 25      7    %
4      Age       25-34     24    %

In [10]:
results_2023.isnull().sum()

Name           0
Race           0
Year           0
Gender         0
Age            0
Finish         0
Age Bracket    0
dtype: int64

In [11]:
results_2024.isnull().sum()

Name         0
Race         0
Year         0
Gender       0
Finish       0
Age Group    0
dtype: int64

In [12]:
races_2023.isnull().sum()

Race         0
Year         0
Date         0
Finishers    0
dtype: int64

In [13]:
races_2024.isnull().sum()

Race         0
Year         0
Date         0
Finishers    0
dtype: int64

In [14]:
boston_men.isnull().sum()

Year                2
Winner              2
Country             2
Time                2
Distance (Miles)    2
Distance (KM)       2
dtype: int64

In [15]:
boston_women.isnull().sum()

Year                1
Winner              1
Country             1
Time                1
Distance (Miles)    0
Distance (KM)       0
dtype: int64

There is a small number of missing values in the Boston Marathon Winners data. We will drop these rows safely in the cleaning phase since there are very few.

In [16]:
survey_summary.isnull().sum()

Category       0
Subcategory    0
Value          0
Type           0
dtype: int64

In [17]:
#All columns lowercase and replace spaces with underscore

def clean_columns(df):
    df.columns = df.columns.str.lower().str.replace(' ', '_')
    return df

results_2023 = clean_columns(results_2023)
results_2024 = clean_columns(results_2024)
races_2023 = clean_columns(races_2023)
races_2024 = clean_columns(races_2024)
boston_men = clean_columns(boston_men)
boston_women = clean_columns(boston_women)
survey_summary = clean_columns(survey_summary)

In [18]:
#NaN for missing `Age` in 2024 results dataset

results_2024['age'] = np.nan

In [19]:
#Drop missing rows in Boston Marathon Datasets

boston_men.dropna(subset = ['year', 'winner', 'country', 'time'], inplace = True)
boston_women.dropna(subset = ['year', 'winner', 'country', 'time'], inplace = True)

In [20]:
#Standardize Columns for Consistency

boston_men = clean_columns(boston_men)
boston_women = clean_columns(boston_women)

In [21]:
results_2024.head()

,name,race,year,gender,finish,age_group,age
0,Zouhair Talbi,Houston Marathon,2024,Men,7599,25-29,NaN
1,Tsedat Ayana,Houston Marathon,2024,Men,7620,25-29,NaN
2,Hendrik Pfeiffer,Houston Marathon,2024,Men,7634,30-34,NaN
3,Pat Tiernan,Houston Marathon,2024,Men,7665,25-29,NaN
4,Hugo Edgardo Catrileo Tapia,Houston Marathon,2024,Men,7724,25-29,NaN

In [22]:
boston_men.isnull().sum()

year                0
winner              0
country             0
time                0
distance_(miles)    0
distance_(km)       0
dtype: int64

In [23]:
boston_women.isnull().sum()

year                0
winner              0
country             0
time                0
distance_(miles)    0
distance_(km)       0
dtype: int64

results_2024 now has the 'Age' column so we can combine it with results_2023. We dropped the rows in boston_men and boston_women so now there is zero null values.

Need to verify columns are the same before we combine.

In [24]:
set(results_2023.columns) == set(results_2024.columns)

False

In [25]:
print('Columns in 2023 not in 2024:', set(results_2023.columns) - set(results_2024.columns))
print('Columns in 2024 not in 2023:', set(results_2024.columns) - set(results_2023.columns))

Columns in 2023 not in 2024: {'age_bracket'}
Columns in 2024 not in 2023: {'age_group'}

In [27]:
print("2023 columns:", results_2023.columns)
print("2024 columns:", results_2024.columns)

print("2023 groups:", results_2023['age_bracket'].unique())
print("2024 groups:", results_2024['age_group'].unique())

2023 columns: Index(['name', 'race', 'year', 'gender', 'age', 'finish', 'age_bracket'], dtype='object')
2024 columns: Index(['name', 'race', 'year', 'gender', 'finish', 'age_group', 'age'], dtype='object')
2023 groups: ['55-59' 'Under 35' '50-54' '45-49' '35-39' '40-44' '60-64' 'Unknown'
 '65-69' '80 and Over' '70-74' '75-79']
2024 groups: ['25-29' '30-34' '35-39' '40-44' '20-24' '45-49' '50-54' 'Under 20'
 '55-59' '60-64' '65-69' '70-74' '75-79' '80 and Over']

Adding a function next to make consistent bins for the age groups in both results datasets.

In [28]:
#Defining a function
def standardize_age_group(age):
    if pd.isnull(age):
        return 'Unknown'
    elif age < 20:
        return 'Under 20'
    elif 20 <= age <= 24:
        return '20-24'
    elif 25 <= age <= 29:
        return '25-29'
    elif 30 <= age <= 34:
        return '30-34'
    elif 35 <= age <= 39:
        return '35-39'
    elif 40 <= age <= 44:
        return '40-44'
    elif 45 <= age <= 49:
        return '45-49'
    elif 50 <= age <= 54:
        return '50-54'
    elif 55 <= age <= 59:
        return '55-59'
    elif 60 <= age <= 64:
        return '60-64'
    elif 65 <= age <= 69:
        return '65-69'
    elif 70 <= age <= 74:
        return '70-74'
    elif 75 <= age <= 79:
        return '75-79'
    else:
        return '80 and Over'

In [29]:
results_2023['age_group'] = results_2023['age'].apply(standardize_age_group)
results_2024['age_group'] = results_2024['age'].apply(standardize_age_group)

In [ ]:
print('2023 columns:', results_2023.columns)
print('2024 columns:', results_2024.columns)

2023 columns: Index(['name', 'race', 'year', 'gender', 'age', 'finish', 'age_bracket',
       'age_group'],
      dtype='object')
2024 columns: Index(['name', 'race', 'year', 'gender', 'finish', 'age_group', 'age'], dtype='object')

In [31]:
#Drop the 'age_bracket' from 2023 since its redundant
results_2023 = results_2023.drop(columns = ['age_bracket'])

In [32]:
print('2023 columns after drop:', results_2023.columns)
print('2024 columns:', results_2024.columns)

2023 columns after drop: Index(['name', 'race', 'year', 'gender', 'age', 'finish', 'age_group'], dtype='object')
2024 columns: Index(['name', 'race', 'year', 'gender', 'finish', 'age_group', 'age'], dtype='object')

In [33]:
#Getting the columns in the correct order
results_2024 = results_2024[['name', 'race', 'year', 'gender', 'age', 'finish', 'age_group']]

In [35]:
print('2023 columns:', results_2023.columns)
print('2024 columns:', results_2024.columns)

2023 columns: Index(['name', 'race', 'year', 'gender', 'age', 'finish', 'age_group'], dtype='object')
2024 columns: Index(['name', 'race', 'year', 'gender', 'age', 'finish', 'age_group'], dtype='object')

In [36]:
combined_results = pd.concat([results_2023, results_2024], ignore_index = True)

In [37]:
combined_results.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1026921 entries, 0 to 1026920
Data columns (total 7 columns):
 #   Column     Non-Null Count    Dtype
---  ------     --------------    -----
 0   name       1026921 non-null  object
 1   race       1026921 non-null  object
 2   year       1026921 non-null  int64
 3   gender     1026921 non-null  object
 4   age        429266 non-null   float64
 5   finish     1026921 non-null  int64
 6   age_group  1026921 non-null  object
dtypes: float64(1), int64(2), object(4)
memory usage: 54.8+ MB

In [38]:
combined_results.head()

,name,race,year,gender,age,finish,age_group
0,Arunas Jurkus,Salt Lake City Marathon,2023,M,55.0,12907,55-59
1,Seth Reed,Salt Lake City Marathon,2023,M,24.0,12921,20-24
2,Mufaro Chivasa,Salt Lake City Marathon,2023,M,54.0,12948,50-54
3,Adam Cheney,Salt Lake City Marathon,2023,M,22.0,12954,20-24
4,Michael Pyles,Salt Lake City Marathon,2023,M,33.0,12964,30-34

Some results have exact ages while other only have an age group. For consistent analysis we convert age groups into approximate values and combine it with existing ages.

In [39]:
#Define mapping from age groups to midpoints
age_map = {
    'Under 20': 18,
    '20-24': 22,
    '25-29': 27,
    '30-34': 32,
    '35-39': 37,
    '40-44': 42,
    '45-49': 47,
    '50-54': 52,
    '55-59': 57,
    '60-64': 62,
    '65-69': 67,
    '70-74': 72,
    '75-79': 77,
    '80 and Over': 82,
    'Unknown': np.nan
}

In [40]:
#New column age_numeric, prioritizing age otherwise use age_map
combined_results['age_numeric'] = combined_results['age'].fillna(
    combined_results['age_group'].map(age_map)
)

In [41]:
combined_results[['age', 'age_group', 'age_numeric']].head(20)

     age age_group  age_numeric
0   55.0     55-59         55.0
1   24.0     20-24         24.0
2   54.0     50-54         54.0
3   22.0     20-24         22.0
4   33.0     30-34         33.0
5   30.0     30-34         30.0
6   31.0     30-34         31.0
7   28.0     25-29         28.0
8   20.0     20-24         20.0
9   49.0     45-49         49.0
10  21.0     20-24         21.0
11  24.0     20-24         24.0
12  37.0     35-39         37.0
13  25.0     25-29         25.0
14  30.0     30-34         30.0
15  28.0     25-29         28.0
16  25.0     25-29         25.0
17  43.0     40-44         43.0
18  64.0     60-64         64.0
19  31.0     30-34         31.0

In [42]:
combined_results.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1026921 entries, 0 to 1026920
Data columns (total 8 columns):
 #   Column       Non-Null Count    Dtype
---  ------       --------------    -----
 0   name         1026921 non-null  object
 1   race         1026921 non-null  object
 2   year         1026921 non-null  int64
 3   gender       1026921 non-null  object
 4   age          429266 non-null   float64
 5   finish       1026921 non-null  int64
 6   age_group    1026921 non-null  object
 7   age_numeric  429266 non-null   float64
dtypes: float64(2), int64(2), object(4)
memory usage: 62.7+ MB